Ran Plan for dir: `deployment/cloud` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.repo_gitops.github_repository_deploy_key.repository_deploy_key[0] will be created
+ resource "github_repository_deploy_key" "repository_deploy_key" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + key        = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDVTFXE0Kq2SAwBXjPKJEFDRFejHd1xZPwvzAJPlWlG1jFpybEvrUTErwdtdKNtyCXB+P2gSy5E78Vu7pwdN9X1bFzpDkCm5ZdaK/l6jesXSYqACV7sPTBby7yopLvGIkbWIx+0I/encnBHZwAkLMv2vF2FYwbx//XvQ6r7XkDgTIE7BvU7v8QeIbpN/LNQANuQ2we340G2BJYcOqcuEyQnBMFNphMcuJAXGx97xoQRISYvyUsbs46W+YWps6bN7mFwYwZiTtSWfm7sW8C20IoBDsVBaardkm7N06MLe0xsZ9VmyXSFDFPCC06lm+j72S3731FsjSGvepOBym3uZiax
        EOT
      + read_only  = false
      + repository = "fta_gitops"
      + title      = "fta_gitops-public-key"
    }

  # module.repo_gitops.kubernetes_secret_v1.argocd[0] will be created
+ resource "kubernetes_secret_v1" "argocd" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "repository"
            }
          + name             = "fta-gitops"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```